app/controllers/school_classes_controller.rb

    def create
        @class = SchoolClass.create(school_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Geometry"], ["room_number", 229]]

    def find_class
        @class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]