app/controllers/students_controller.rb

    def update
        @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Vanessa"], ["updated_at", "2020-10-29 05:09:58.858485"], ["id", 1]]